{"pageProps":{"note":{"id":"2m4of0ylaxbolagj8fov8br","title":"Razmisli","desc":"","updated":1726609060174,"created":1658754729845,"custom":{},"fname":"journal.Razmisli","type":"note","vault":{"fsPath":"vault"},"contentHash":"681436b400c39fd94b291cea3bd01aa3","links":[],"anchors":{"actions":{"type":"header","text":"Actions","value":"actions","line":11,"column":0,"depth":1},"general":{"type":"header","text":"General","value":"general","line":18,"column":0,"depth":1},"speeches":{"type":"header","text":"Speeches","value":"speeches","line":51,"column":0,"depth":1},"oxford":{"type":"header","text":"Oxford","value":"oxford","line":111,"column":0,"depth":1},"fitness-and-health":{"type":"header","text":"Fitness and health","value":"fitness-and-health","line":132,"column":0,"depth":1},"ive-lost-motivation":{"type":"header","text":"I've lost motivation...","value":"ive-lost-motivation","line":141,"column":0,"depth":1},"podcasts":{"type":"header","text":"Podcasts","value":"podcasts","line":162,"column":0,"depth":1},"know-yourself---httpsprinciplesyoucom":{"type":"header","text":"Know yourself - https://principlesyou.com/","value":"know-yourself---httpsprinciplesyoucom","line":186,"column":0,"depth":2},"managing-your-work-and-setting-goals":{"type":"header","text":"Managing your work and setting goals","value":"managing-your-work-and-setting-goals","line":188,"column":0,"depth":1},"tc":{"type":"header","text":"TC","value":"tc","line":200,"column":0,"depth":1},"blind":{"type":"header","text":"Blind","value":"blind","line":221,"column":0,"depth":1},"communication":{"type":"header","text":"Communication","value":"communication","line":275,"column":0,"depth":1},"покупка-на-жилище":{"type":"header","text":"Покупка на жилище","value":"покупка-на-жилище","line":279,"column":0,"depth":1},"dealing-with-rejection":{"type":"header","text":"Dealing with rejection","value":"dealing-with-rejection","line":283,"column":0,"depth":1},"scaling-tech-business":{"type":"header","text":"Scaling tech business","value":"scaling-tech-business","line":289,"column":0,"depth":1},"birthday-wishes":{"type":"header","text":"Birthday wishes","value":"birthday-wishes","line":296,"column":0,"depth":1},"conversation-qa-chit-chat":{"type":"header","text":"Conversation Q&A (Chit Chat)","value":"conversation-qa-chit-chat","line":316,"column":0,"depth":1},"story-telling":{"type":"header","text":"Story telling","value":"story-telling","line":345,"column":0,"depth":1},"in-ds-presentation":{"type":"header","text":"In DS presentation","value":"in-ds-presentation","line":347,"column":0,"depth":2},"taking-time-to-answer-questions":{"type":"header","text":"Taking time to answer questions","value":"taking-time-to-answer-questions","line":374,"column":0,"depth":2},"random-thoughts-on-engineering-topics-that-i-have-seen-or-thought-about":{"type":"header","text":"Random thoughts on engineering topics that I have seen or thought about.","value":"random-thoughts-on-engineering-topics-that-i-have-seen-or-thought-about","line":389,"column":0,"depth":1},"big-tech-revenue-streams":{"type":"header","text":"Big Tech Revenue Streams","value":"big-tech-revenue-streams","line":393,"column":0,"depth":1},"feeling-a-bit-down":{"type":"header","text":"Feeling a bit down","value":"feeling-a-bit-down","line":430,"column":0,"depth":1},"my-principles-to-get-back-on-track":{"type":"header","text":"My principles to get back on track","value":"my-principles-to-get-back-on-track","line":439,"column":0,"depth":2},"getting-in-the-zone-with-pomodoro":{"type":"header","text":"Getting in the zone with Pomodoro","value":"getting-in-the-zone-with-pomodoro","line":451,"column":0,"depth":1}},"children":[],"parent":"849u97nrsuyekmr4a1r92ux","data":{}},"body":"<h1 id=\"razmisli\">Razmisli<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#razmisli\"></a></h1>\n<p>Life is not a problem to be solved, it is an adventure to be experienced.</p>\n<h1 id=\"actions\">Actions<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#actions\"></a></h1>\n<p>These action items have arose after doing razmisli.</p>\n<ul>\n<li>define clear dream</li>\n<li>define passion which can bring value to other people</li>\n<li>find a product which you would be passionate about</li>\n<li>occasionally check yourself where you are compared to others ('сверявай си часовника'), e.g. blind, forums, articles, friends and family. Don't fall in the trap of just working by yourself. Competition is what drives people and opportunities.</li>\n</ul>\n<h1 id=\"general\">General<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#general\"></a></h1>\n<p>What do I want to do with my life?</p>\n<ul>\n<li>In short term, I want to have few career accomplishments - competitive programmer, kaggle expert, successful quant,\nmake some good money.</li>\n<li>Long term, accomplish dream to own business, entrepreneur, MORE money, takiva raboti.</li>\n</ul>\n<hr>\n<p>What is my dream?</p>\n<ul>\n<li>I am looking for concrete dream. I know I want to become entrepreneur (tech stuff/fintech probably), but am still searching\nfor the product that I would be passionate about.</li>\n</ul>\n<hr>\n<p>What are my passions?</p>\n<ul>\n<li>I like solving problems, seeing the green light in coding problems makes me happy. I like maths and solving puzzle/competitive\nquestions. ML is interesting too, though I have not been deep in that. Need to try out Kaggle seriously. \"Mnogo zuburski otgovor\".</li>\n</ul>\n<hr>\n<p>Jivota mi e bolka i zadachi</p>\n<hr>\n<p>What is love?</p>\n<hr>\n<p>How to have meaningful and thoughtful discussions?</p>\n<hr>\n<h1 id=\"speeches\">Speeches<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#speeches\"></a></h1>\n<p>Steve Jobs graduation speech - <a href=\"https://www.youtube.com/watch?v=UF8uR6Z6KLc&#x26;ab_channel=Stanford\">youtube</a>.\nHis three stories:</p>\n<ul>\n<li>Believe that the dots will connect</li>\n</ul>\n<p>He was adopted when he was born. Six month in college he had no idea what he was doing and did not see value in it. He decided to attend classes which he was interested in! He stayed in college, just did not study what he had to. Studied calligraphy and was super interested in it. At the time of the study he had no idea how it would help him. 10 years later it came back when designing Mac. Cannot connect the dots looking forward but it all comes back! You need to believe that the dots will connect!</p>\n<ul>\n<li>Love and loss - Keep looking, don't settle</li>\n</ul>\n<p>He was fired when he was 30 from his own company. He decided to start over. \"Being fired from Apple was one of the best things happened to me.\" Started his most creative years - founded Next, Pixel, found his wife. The only thing helped him go through this period was that he knew was he loved doing. \"You have to believe in your work. In order to believe in your work, you need  to love it. Don't settle!\"</p>\n<ul>\n<li>Death - thinking about death makes you think 'I have noting to loose, follow your heart'</li>\n</ul>\n<p>\"If you live each day as if it's your last, someday you will be right.\" Look in the mirror and ask yourself \"If today is my last day would I do this today.\" Many 'no-s' in a row means you need to change something.\nDeath is the destination we all share. Your time is limited, have the courage to follow your heart and intuition. They somehow know what you want to do - everything else is secondary.</p>\n<p><strong>Stay hungry, stay foolish!</strong></p>\n<hr>\n<p>Elon Musk: Argue from basic truths vs by analogy</p>\n<p>Questions you should always ask/think about.</p>\n<p>Talking with my father is super productive, I learn so much stuff about life. Topics on which I should focus:</p>\n<ul>\n<li>economics/trade he has great intuition about these stuff</li>\n<li>general life advices</li>\n<li>how to talk with people</li>\n<li>he is always interested in other people and naturally curious</li>\n</ul>\n<hr>\n<p>Nai skupata taina na sveta</p>\n<hr>\n<p><a href=\"https://www.youtube.com/watch?v=I0booXqf5W4&#x26;ab_channel=TEDxTalks\">The Mars generation is shooting for the stars</a></p>\n<p>\"Make my dreams turn into a goal\" - Tatyana</p>\n<p>Prioritazing my goals drastically changed the circle of people around me. By focusing on my work and studies, I attracted the right people around me.</p>\n<p>Whereever you go, you will follow your dream, you will speak the truth, you will be vocal, you will share your story.</p>\n<p>\"Imagine that this astronout is you. You are capable of doing everything as long as you believe it.\"</p>\n<hr>\n<p><a href=\"https://www.youtube.com/watch?v=GltlJO56S1g&#x26;t=29s&#x26;ab_channel=CNBC\">Jeff Bezos in 1999</a></p>\n<p>Long term I believe it is very easy to predict lots of successful companies born of the internet - with very large market caps and so on. I also believe that today, it is very hard to predict which are these companies.</p>\n<p>If you can focus <strong>obsessively</strong> enough on customer experience, they you would have a good chance.</p>\n<p>If it one thing what Amazon is about it is excessive attention to customer experience end-to-end.</p>\n<p>In the long term there is never misaalignment in shareholder experience and customer experience.</p>\n<h1 id=\"oxford\">Oxford<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#oxford\"></a></h1>\n<p>I made lots of mistakes during my 4 years at uni. When I started I thought too much of myself and that I could do whatever I want. Didn't realize that the true work actually started then... I thought I did so much work at highschool and that success was 'v kurpa vurzano'. Kind of wasted first year completely and half of second year. Had some 'love' distractions which affected my study focus and was pretty bad. Basically these 'love' distractions distracted me for nearly 4 years... Super stupid from my side but well, that's it. Now in 2022 I am fully back. I think I got over the love distractions in 100% around March 2020 (covid started and was last year of uni). At that point in time I have 0 in-person and remote contact with the distraction. Felt good. Felt great.</p>\n<p>The fact that when talking about my Oxford experience I firstly start rambling about 'love' distractions proves I wasted a fair amount of time there. It is a pity to waste Oxford years like that but whatever.</p>\n<p>Main mistake I made during these 4 years is that I did not ave a clear and consistent study plan. I was mainly studying in Hilary and Trinity, skipped lots of classes and lectures and did not have a way to measure my progress. I did not track time/work done in almost any way. And then I got average grades and just complained..</p>\n<p>Another mistake is I had some bad influence from toxic people. Should avoid this toxicity as much as possible!</p>\n<p>Had a lot of procrastination too</p>\n<p>Main mistake is I did not have a plan. Cultural plan, Studying plan, How to live independently plan, healthy lifestyle plan.</p>\n<hr>\n<p>SIG internship</p>\n<p>Malko me pobivat trupki kato se setq za tozi experience</p>\n<hr>\n<h1 id=\"fitness-and-health\">Fitness and health<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#fitness-and-health\"></a></h1>\n<p>It is not expensive (time-wise and money-wise) to become nacepen. You basically pay fixed cost first 2 months to get nacepen,\nthen you need to pay small regular costs (2,3 times per week). Gym helps me to be more productive when working too. My most efficient work periods have always been when I go to gym regularly too. So it is worth it. Abs is all about diet.</p>\n<hr>\n<h1 id=\"ive-lost-motivation\">I've lost motivation...<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#ive-lost-motivation\"></a></h1>\n<p>How to bring back your motivation and be productive?</p>\n<p><strong>Goal: Get your high energy state back!</strong></p>\n<ul>\n<li>Eat healthy/loose weight</li>\n<li>Go to gym (helps a lot)</li>\n<li>Listen to motivational/party music</li>\n<li>Work, work, work</li>\n<li>Avoid being in states where you lie all day, watch movies/tv-series and play games</li>\n</ul>\n<p><strong>You cannot get depressed if you do not belive depression exists - Andrew Tate hahah</strong></p>\n<p>Songs </p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=ftgcdlazhk0\">Dara - Thunder</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=D5YbBZpdjAE\">Dara - Cold as Ice</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=keh-V_DP0y8\">100 Kila - Nqma takava jena</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=tQ5oMD5QDX4\">Upsurt - 3v1</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=uAVUl0cAKpo\">Sabrina Carpenter - Thumbs</a></li>\n</ul>\n<hr>\n<h1 id=\"podcasts\">Podcasts<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#podcasts\"></a></h1>\n<p><a href=\"https://www.youtube.com/watch?v=8RVa0THWUWw&#x26;ab_channel=LexFridman\">Garry Kasparov</a></p>\n<p>Fear of mistakes guarantees making mistakes.</p>\n<p>Key in success is not fear of mistakes or love of winning. It is a passion to make a difference.</p>\n<p>\"I always think that the outcome of the game depends on my gameplay\"</p>\n<p>Machine will beat human in closed systems like chess.</p>\n<p><a href=\"https://www.youtube.com/watch?v=5zOHSysMmH0&#x26;ab_channel=LexFridman\">Mark Zuckerberg</a></p>\n<p>health, loving familiy and friends, <strong>making time for friends</strong></p>\n<p><strong>be excited for something in the future</strong></p>\n<p>need to have something you are looking forward to</p>\n<p>hiring heuristic: Hire somebody only if you would be happy to work on them.</p>\n<p><a href=\"https://www.youtube.com/watch?v=TISMidxdZoc\">Ray Dalio</a></p>\n<h2 id=\"know-yourself---httpsprinciplesyoucom\">Know yourself - <a href=\"https://principlesyou.com/\">https://principlesyou.com/</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#know-yourself---httpsprinciplesyoucom\"></a></h2>\n<h1 id=\"managing-your-work-and-setting-goals\">Managing your work and setting goals<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#managing-your-work-and-setting-goals\"></a></h1>\n<p>You have underestimated planning and project management. For example when you started using Jira tasks, roadmap, backlog, sprints, these have increased your productivity significantly. Being able to track what you do is super important. Writing things down is highly underappreciated. Writing when and what you achive and seeing it regularly adds lots of value and helps for conistency.</p>\n<hr>\n<p>Getting in FAANG has lots of learning value. Will have the chance to learn super many new stuff. Meta publishes papers every week, including in big conferences like NeurIPS.\nI should aim for TC + going in such places with lots of smart people. Stefan seemed quite impressed by Meta tools and leaning stuff so it must be really good stuff.</p>\n<hr>\n<h1 id=\"tc\">TC<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#tc\"></a></h1>\n<p>High TC factors/variables are:</p>\n<ul>\n<li>interview skills: getting interviews + doing interviews (behaviour + technical)</li>\n<li>your skillset and whether you can do the job (this is important but interviewing skills are more important to get high TC)</li>\n<li>YOE</li>\n<li>market</li>\n</ul>\n<p>Taka kakto za kasierka davat 2k ne zashtoto izkarva na firmata 2k+, taka v tech plashtat mn pari za gluposti.</p>\n<p>Main TC factor is interview skills. It is similar to rising in power in democratic countries. Main skill is marketing/populism and winning elections. Other things such as economics knowldge, finance, politics, leadership, giving speeches, diplomacy are secondary. It is all about winning elections. High TC is all about cracking the interviews.</p>\n<hr>\n<p>This year tech companies struggle. High interest rates means high cost to loan money.</p>\n<p>Tech companies don't do lending. Lots of regulations, huigh buy-in.</p>\n<hr>\n<h1 id=\"blind\">Blind<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#blind\"></a></h1>\n<p>Which is more prestigious DS vs SDE? 13 vs 73</p>\n<p>Getting 200k in DS vs SDE is easier? 12 vs 57</p>\n<p>Can get from DS to SDE, yes vs no? 42 vs 4</p>\n<p>Which career makes more more on average, DS vs SDE vs the same? 27 vs 135 vs 23</p>\n<p>Does IDE matter Language specific vs general vs the same? 39 vs 14 vs 23</p>\n<p>Which is better on CV, Yelp vs C1? 89 vs 45</p>\n<p>Top 5% TC-wise in London, 2YOE.\n300k+ 31 votes, 200k 15 votes, 150k 10 votes, 100 9votes, 120 8 votes, 250k 8 votes</p>\n<p>London TC-s for 2 YOE in hedge funds are around 200k (even sde-s can get that). Quant devs, Quant analyst/ research are coser to this. </p>\n<p>Meta TC Sanfrancisco is likley to be 300k for 2 YOE (E5)</p>\n<hr>\n<p><strong>On job hopping</strong></p>\n<p>Job switching requires work which a fair number of people aren't willing to do.\nWe have all met people who have worked the same job for 10 years etc...</p>\n<p>Companies know this and accounting departments have realized that people are willing to exchange the feeling of \"comfort\" (but not actual job security) of being in the same job for less than market compensation. Its optimizing for people's inertia.</p>\n<p>This is why this community exists as it allows us in the industry the tools to collaborate to ensure we make the best TC we can.</p>\n<p>This trend of needing to job hop extends far beyond tech and really is the economy as a whole. The boomer mythos of working the same job and showing loyalty to move up is well and thoroughly dead but it's remnants still exist and seep into people's perceptions.</p>\n<p>So now that you realize this. Go out there and apply, it's the only way to truly determine your market TC. And take this lesson to heart, you owe companies nothing, it's simply an exchange of your time for more money.</p>\n<hr>\n<p>Мотивацията е силно надценена. Постоянството е ключа.  Изгради система от малки задачи/навици, които да те изведат до успеха.</p>\n<hr>\n<p>Financials</p>\n<p>P/E ratio</p>\n<p>EPS ratio</p>\n<p>Quarterly earnings</p>\n<p>how to read balance sheet</p>\n<hr>\n<h1 id=\"communication\">Communication<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#communication\"></a></h1>\n<p>Conversations based on sarcasm, \"vsichko e na buzik\" mindset is a powerful framework. Your starting point in having conversations with people is not to think about yourself (or proving yourself), rather think that everything is a joke.</p>\n<h1 id=\"покупка-на-жилище\">Покупка на жилище<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#покупка-на-жилище\"></a></h1>\n<p>В София апартаментите ще стават все по-недостъпни. Ще стане като Лондон, където масово хората живеят под наем, защото не могат да си позволят апартамент. След 20-30 години ще стане такаи в София.</p>\n<h1 id=\"dealing-with-rejection\">Dealing with rejection<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#dealing-with-rejection\"></a></h1>\n<p>Job hunt rejection. It is not personal, when they say it is not a good fit, it indeed is is not a good fit! And probs you did not do well enough on the interview. Just move on and apply at a bunch of places.</p>\n<p>Asking out girls and when they say no. She did nothing to you. You made an offer and she declined. As simple as that. Just move on.</p>\n<h1 id=\"scaling-tech-business\">Scaling tech business<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#scaling-tech-business\"></a></h1>\n<p>Avoid premature optimization. Check how levels fyi scaled to million of users using google sheets.</p>\n<p><a href=\"https://www.levels.fyi/blog/scaling-to-millions-with-google-sheets.html\">article</a></p>\n<p>sad</p>\n<h1 id=\"birthday-wishes\">Birthday wishes<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#birthday-wishes\"></a></h1>\n<p>Your birthday is the perfect excuse to get drunk on a weekday. Bottoms up!</p>\n<p>“Happy birthday! Your life is just about to pick up speed and blast off into the stratosphere. Wear a seat belt and be sure to enjoy the journey. Happy birthday!”</p>\n<p>Congratulations on being even more experienced.</p>\n<p>“Wishing you a beautiful day with good health and happiness forever. Happy birthday!”</p>\n<p>Happy Birthday Amy! Congratulations on being even more experienced. Wear a seat belt and be sure to enjoy the journey of life. I wish you a wonderful time ahead!</p>\n<p>Best wishes on your birthday! May you have maximum fun today, and minimum hangover tomorrow!</p>\n<p>Hope your special day brings you all that your heart desires! Here’s wishing you a day full of pleasant surprises! Happy birthday!</p>\n<h1 id=\"conversation-qa-chit-chat\">Conversation Q&#x26;A (Chit Chat)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#conversation-qa-chit-chat\"></a></h1>\n<p>How are you doing?</p>\n<p>Tell me about yourself</p>\n<p>Weather talk.. What’s your favorite season and why?</p>\n<p>Do you have any pets? What are their names? What’s your favorite animal?</p>\n<p>What were you obsessed with when you were a child? </p>\n<p>What’s your most controversial opinion? </p>\n<p>Do you have any brothers or sisters?</p>\n<p>What food would you eat every day if you could?</p>\n<p>What music do you listen to?</p>\n<p>What are you going to do this weekend?</p>\n<p>What do you do to relax?</p>\n<p>What’s your favorite thing about your hometown? </p>\n<h1 id=\"story-telling\">Story telling<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#story-telling\"></a></h1>\n<h2 id=\"in-ds-presentation\">In DS presentation<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#in-ds-presentation\"></a></h2>\n<p><strong>Template for graphs/figures:</strong></p>\n<p>On this graph you can see.</p>\n<p>The message you should take out of the graph....</p>\n<p>What this figure shows you is that...</p>\n<p>The implication that you get from this graph is...</p>\n<p><strong>Structure</strong></p>\n<p>Intro: </p>\n<ul>\n<li>set expectations</li>\n<li>quick mention of an appropriate joke</li>\n</ul>\n<p>Mid game:</p>\n<ul>\n<li>Between switching topics, ask if there are any questions!</li>\n</ul>\n<p>End:</p>\n<ul>\n<li>Thank you for your attention. I am happy to answer any questions you might have.</li>\n</ul>\n<h2 id=\"taking-time-to-answer-questions\">Taking time to answer questions<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#taking-time-to-answer-questions\"></a></h2>\n<p>Quick stalling: \"This is a good question. I have not thought about it before. Let me think about it for a moment.\"</p>\n<p>Understand the question/take more time: Rephrasing the question: </p>\n<ul>\n<li>\"From my understanding, you want to know...\"</li>\n<li>\"What you are asking is whether...\"</li>\n<li>\"In other words...\"</li>\n</ul>\n<p>Take things off-line:</p>\n<ul>\n<li>I don't have the answer to that question right now. I will get back to you on that.</li>\n<li>I don't want to give you the wrong information, so let me get back to you.</li>\n</ul>\n<h1 id=\"random-thoughts-on-engineering-topics-that-i-have-seen-or-thought-about\">Random thoughts on engineering topics that I have seen or thought about.<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#random-thoughts-on-engineering-topics-that-i-have-seen-or-thought-about\"></a></h1>\n<ul>\n<li><a href=\"https://blog.pragmaticengineer.com/\">the pragmatic engineer blog</a></li>\n</ul>\n<h1 id=\"big-tech-revenue-streams\">Big Tech Revenue Streams<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#big-tech-revenue-streams\"></a></h1>\n<p>Microsoft:</p>\n<ul>\n<li>Azure (31%)</li>\n<li>MS Office (23%)</li>\n<li>Windows (13%)</li>\n<li>Gaming (9%)</li>\n<li>Linkdin (6%)</li>\n<li>Search Ads, Bing (5%)</li>\n<li>15% Other</li>\n</ul>\n<p>Microsoft portfolio is tech dependent - cloud service, software, OS, games and a bit of ads. Super <strong>diversified</strong>. Less recession dependent.</p>\n<p>Amazon:</p>\n<ul>\n<li>Amazon Store (47%)</li>\n<li>Third Party eller Service (22%) - shipping, commisions etc</li>\n<li>AWS (13%)</li>\n<li>Amazon Prime(7%)</li>\n<li>Ads (6%)</li>\n</ul>\n<p>Amazon portfolio is recession dependent as it depends of everyday spends of people. Amazon is business which depend on everyday retail a lot ~ 80%</p>\n<p>Apple:</p>\n<ul>\n<li>Iphone (52%)</li>\n<li>Services - Apple TV,Music,Pay (19%)</li>\n<li>Wearables - headphones, hardware (10%)</li>\n<li>Mac - (9.6%)</li>\n<li>Ipad - (9%)</li>\n</ul>\n<p>Apple portfolio is tech retail dependent. Apple has the advantage of being  \"cool\".</p>\n<p>Google </p>\n<ul>\n<li>81 % from ads</li>\n</ul>\n<p>Meta</p>\n<ul>\n<li>97 % from ads</li>\n</ul>\n<h1 id=\"feeling-a-bit-down\">Feeling a bit down<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#feeling-a-bit-down\"></a></h1>\n<p>It is  17th of Sept 2024 - Sofia holiday, but also trung thu hah! I can't believe I'm writing these things down. Haven't done actual journaling for a while... I'm a bit lost on what I should be doing. there are a lot of tasks that need to be done, both in personal developement (professional and emotional) and at work.</p>\n<p>I've been eating unhealthy the past months. A lot of tupchene and  just can't stop. I am not fat (yet) just about 77-78 kilos. Bought a flat three months ago and was exciting. My problem is that career-wise I haven't improved much. TC is okish at 160K annually and that is good.  But my problem is that the last 2 years there have been little progress both in terms of TC but also in terms of skills/learnings. I found a girl that I like but it is an LDR - kind of sucks. All is good with her and I feel good about it. There are some yellow/red-ish flags but only time will show if my concerns are unnecessary. I think I will give it a chance.</p>\n<p>Career-wise, my problem solving abilties are more or less the same as 2 years ago. OMG time flies so fast. I learned a bit of Kaggle, just slightly. Need to get back to speed with competitive programming. </p>\n<p>Personal developement: I'm behind on reading lots of books, finance planning.</p>\n<h2 id=\"my-principles-to-get-back-on-track\">My principles to get back on track<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#my-principles-to-get-back-on-track\"></a></h2>\n<ol>\n<li>Do NOT over-eat, drink a lot of water strategy</li>\n<li>Regular sports</li>\n<li>Track your work/progress: Pomodoro and Jira</li>\n<li>Keep focused: turn off WiFi</li>\n<li>Personal development: property market, news, self-development books, financial planning</li>\n<li>Get enough sleep: sleep earl and get up early!</li>\n</ol>\n<h1 id=\"getting-in-the-zone-with-pomodoro\">Getting in the zone with Pomodoro<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#getting-in-the-zone-with-pomodoro\"></a></h1>\n<p>The technique uses a timer to break down work into intervals traditionally 25 minutes in length, separated by short breaks.</p>\n<p>There are five basic steps to implementing the technique:</p>\n<ol>\n<li>Decide on the task to be done</li>\n<li>Set the pomodoro timer to n minutes (traditionally 25)</li>\n<li>Work on the task until the timer rings; record with an x</li>\n<li>Take a short break (3–5 minutes)</li>\n<li>After four pomodoros, take a longer break (15–30 minutes)</li>\n</ol>","noteIndex":{"id":"wn8PE1RhG0znK1alrGFYv","title":"Root","desc":"","updated":1763992060664,"created":1631901573363,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"dc095b340c158394d643b84f8585ff0c","links":[],"anchors":{},"children":["dgcsvcwea8scgdegrk9tfni","xig93vo47ou1bkr7s4w1wb2","ro9bbyftsutm88mxw6r16p5","ypia1zmywsklpicmcgrzlz1","w7iitlako61ppm27mym400a","6bx5plramu4hksomqc1n55z","4nki3bedlvs3mnkixj3a07k","9r5ym61dkwap92fvbte1jkq","849u97nrsuyekmr4a1r92ux","2b5bwf46z6v132wu7xghvrp","dygp5h2vzw4mkromwmofynb","7h50s7ga5ziiyblmoctsqmw","pglaolxcge4xfvgoph3je89","uy9u1co5ih1fokind8tg0eq","jc23ggp8iiu92kpnzo721to","f1u2a47guuw70olv36bzf66","c1bs7wsjfbhb0zipaywqv1","2av385tcj2cbumxprsauff3","lw1b4r6ykimvj9208nkgzps"],"parent":null,"data":{},"body":"\nZdr bebce kp ;)\n\nThis is my knowledge base, additionally I keep [daily journal](https://docs.google.com/document/d/1m8Npu0-t8RweyKiHCjLL1PPDYzbebqm3OZDHH8IVsb8/edit?tab=t.rj0kvkrm7zpr)."},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":false,"leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2,"vaultSelectionModeOnCreate":"smart"}},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"randomNote":{},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":true,"maxPreviewsCached":10,"maxNoteLength":204800,"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"enableUserTags":true,"enableHashTags":true,"dendronVersion":"0.95.0","enableEditorDecorations":true,"enableFullHierarchyNoteTitle":false,"templateHierarchy":"template"},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Dendron","description":"Personal knowledge space"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/dendron-wiki","siteUrl":"https://ngocuong0105.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"light","templateVersion":"0.97.0","ga":{"tracking":"G-W5DRRLQ1N7"},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}